Revit 2026 API

# FormatOptionsUseDigitGrouping Property

---

Indicates if digit grouping symbols should be displayed.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool UseDigitGrouping { get; set; }
```
```vb
Public Property UseDigitGrouping As Boolean
	Get
	Set
```
```cpp
public:
property bool UseDigitGrouping {
	bool get ();
	void set (bool value);
}
```
```fsharp
member UseDigitGrouping : bool with get, set
```

#### Property Value

Boolean True if digit grouping symbols should be displayed, false otherwise. The default is false.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | UseDefault is true in this FormatOptions. |

When UseDigitGrouping is true, digit grouping symbols (i.e. thousands separators) will be displayed when needed. For example, 123456789.00 may be displayed as 123,456,789.00. The precise display is determined by the DigitGroupingSymbol and DigitGroupingAmount properties of the Units class.

#### Reference

FormatOptions Class

Autodesk.Revit.DB Namespace